<?php

// Heading
$_['heading_title'] = '<img width="24" height="24" src="view/image/neoseo.png" style="float: left;"><p style="margin:0;line-height: 24px;">NeoSeo Интеграция по Brain API</p>';
$_['heading_title_raw'] = 'NeoSeo Интеграция по Brain API';

// Tab
$_['tab_general'] = 'Параметры';
$_['tab_category'] = 'Категории';
$_['tab_product'] = 'Товары';
$_['tab_product_image'] = 'Изображения товаров';
$_['tab_logs'] = 'Логи';
$_['tab_support'] = 'Поддержка';
$_['tab_license'] = 'Лицензия';
$_['tab_usefull'] = 'Корисні посилання';

// Text
$_['text_module_version'] = '';
$_['text_module'] = 'Модули';
$_['text_success'] = 'Настройки модуля обновлены!';
$_['text_success_clear'] = 'Лог файл успешно очищен!';
$_['text_clear_log'] = 'Очистить лог';
$_['text_delete_category'] = 'Удалить категорию';
$_['text_delete_subcategories'] = 'Удалить подкатегории';
$_['text_delete_category_products'] = 'Также товары категории';
$_['text_delete_subcategories_products'] = 'Также товары подкатегорий';
$_['text_remove_category'] = 'Удаление категорий';
$_['text_categories_subcategories'] = 'Категории и подкатегории';

// Button
$_['button_save'] = 'Сохранить';
$_['button_save_and_close'] = 'Сохранить и Закрыть';
$_['button_close'] = 'Закрыть';
$_['button_recheck'] = 'Проверить еще раз';
$_['button_clear_log'] = 'Очистить лог';
$_['button_delete_products'] = 'Удалить товары';

// Entry
$_['entry_status'] = 'Статус';
$_['entry_username'] = 'Логин';
$_['entry_password'] = 'Пароль';
$_['entry_root_categories'] = 'Корневые категории';
$_['entry_categories'] = 'Категории';
$_['entry_autocreate_category'] = 'Автоматически создавать недостающие категории';
$_['entry_product_initial_status'] = 'Начальный статус новых товаров';
$_['entry_product_initial_status_desc'] = 'Если нужна дополнительная обработка товаров, то выключите';
$_['entry_product_initial_stock_status'] = 'Начальный статус наличия новых товаров';
$_['entry_product_initial_stock_status_desc'] = 'Укажите статус наличия, который нужно выставлять созданным продуктам';
$_['entry_product_initial_subtract'] = 'Начальное значение Вычитать со склада';
$_['entry_product_add_parent_categories'] = 'Заполнять родительские категории';
$_['entry_product_add_parent_categories_desc'] = 'Если включено, то товару будут назначены все категории от текущей, до корневой. Иначе будет установлена только категория самого нижнего уровня';
$_['entry_product_update_description'] = 'Обновлять описание';
$_['entry_product_update_image'] = 'Обновлять изображения';
$_['entry_product_update_attribute'] = 'Обновлять аттрибуты';
$_['entry_product_update_filter'] = 'Обновлять фильтр';
$_['entry_product_update_filter_desc'] = 'Поддерживаются Neoseo Filter, Ocfilter';
$_['entry_product_update_manufacturer'] = 'Обновлять производителей';
$_['entry_debug'] = 'Отладочный режим:<br /><span class="help">В логи модуля будет писаться различная информация для разработчика модуля.</span>';
$_['entry_sync_link'] = 'Ссылка для запуска обмена';
$_['entry_cron'] = 'Команда для cron';
$_['entry_cron_price'] = 'Команда для cron Только цена и остаток';
$_['entry_cron_product_image'] = 'Команда для cron Только изображения товаров';
$_['entry_cron_cpanel'] = 'Команда для cron в cpanel';
$_['entry_category_main_menu'] = 'Выводить новые категориив главное меню';
$_['entry_category_neoseo_menu'] = 'Выгружать новые категории NeoSeo Меню';
$_['entry_category_neoseo_menu_desc'] = 'Для работы данной функции необходим установленный модуль NeoSeo Меню';
$_['entry_brainapi_stocks'] = 'Выберите склады с которых необходимо брать остаток и наличие';
$_['entry_brainapi_stocks_desc'] = 'Если ничего не выбрать, все доступные остатки будут суммироваться';
$_['entry_product_code'] = 'Поле для внутреннего кода Брейн Product_code ';
$_['entry_product_code_desc'] = 'Куда писать поле Product_code. Варианты - mpn, upc, ean и т.д. Если не хотите записывать, оставьте поле пустым';
$_['entry_stocks_expected'] = 'Считать как "В наличии" товары под заказ';
$_['entry_stocks_expected_desc'] = 'В брейне существуют помимо наличия на складе, так же возможность получения товара на следующий день. Данная опция позволяет оставить положительный остаток товара есть он доступен в ближайшие дни. Данные будут добавлены по складам выбранным из списка складов';

$_['entry_connect_timeout'] = 'Таймаут между обращениями к API';
$_['entry_connect_timeout_desc'] = 'При проявлении ошибок импорта необходимо увеличить на 1-2 секунды.';

$_['entry_lookup_product_image_code'] = 'Синхронизировать изображения товаров по коду товара из поля';
$_['entry_lookup_product_image_code_desc'] = 'ВНИМАНИЕ - это не код товара в брейн, а id товара - внутри системы брейн. Укажите название поля из таблицы product, по которому необходимо выполнить синхронизацию. По умолчанию, если поле не заполнено, sku';
$_['entry_add_product_images'] = 'Добавить изображения, если они отсутствуют у товара';
$_['entry_update_product_images'] = 'Обновлять существующие изображения товара';
$_['entry_update_product_images_desc'] = 'Существующие изображения товара будут заменены';
$_['entry_separate_product_image_folders'] = 'Отдельные каталоги для изображений товаров';
$_['entry_skip_update_isset_product_image'] = 'Пропустить скачивание изображения, если изображение с таким именем есть на сервере';
$_['entry_skip_update_isset_product_image_desc'] = 'Ускоряет обмен. Но, если на сервисе Brain изменится изображение у товара, то модуль его не скачает еще раз. Изображение сохраняются под именем товара на сайте';
$_['entry_name_product_image'] = 'Называть изображения товаров согласно значению';
$_['entry_subdir_product_image'] = 'Название каталога, куда сохранять изображения товаров.';
$_['entry_subdir_product_image_desc'] = 'Укажите название каталога в image/catalog/,в который будут сохранены изображения товаров. Если поле не заполнено, тогда изображения будут сохранены в image/catalog/';
$_['entry_instruction'] = 'Iнструкцiя до модулю:';
$_['entry_history'] = 'Історія змін:';
$_['entry_faq'] = 'Поширені запитання:';

//Params
$_['params_name_product_image'] = array(
	'name' => 'Имени товара',
	'sku' => 'Артикула товара',
	'model' => 'Модели товара',
	'product_id' => 'ID товара',
);

// Error
$_['error_permission'] = 'У Вас нет прав для управления этим модулем!';
$_['error_download_logs'] = 'Файл логов пустой или отсутствует!';
$_['error_status_module'] = 'Необходимо включить модуль для доступа к этой функции модуля!';
$_['error_ioncube_missing'] = '';
$_['error_license_missing'] = '';
$_['mail_support'] = '';
$_['module_licence'] = '';

//links
$_['instruction_link'] = '<a target="_blank" href="https://neoseo.com.ua/en/index.php?route=blog/soforp_article&article_id=361">https://neoseo.com.ua/en/nastroyka-modulya-brain-api</a>';
$_['history_link'] = '<a target="_blank" href="https://neoseo.com.ua/en/index.php?route=product/product&product_id=289#module_history">https://neoseo.com.ua/en/integraciya-s-brain-api-opencart-v-3-0#module_history</a>';
$_['faq_link'] = '<a target="_blank" href="https://neoseo.com.ua/en/index.php?route=product/product&product_id=289#faqBox">https://neoseo.com.ua/en/integraciya-s-brain-api-opencart-v-3-0#faqBox</a>';
$_['text_module_version']='22';
$_['error_license_missing']='<h3 style = "color: red"> Відсутній файл з ключем! </h3>

<p> Для отримання файлу з ключем зв`яжіться з NeoSeo по email <a href="mailto:license@neoseo.com.ua"> license@neoseo.com.ua </a>, при цьому вкажіть: </p>
<ul>
	<li> назву сайту, на якому ви купили модуль, наприклад, https://neoseo.com.ua </li>
	<li> назву модуля, який ви купили, наприклад: NeoSeo Обмін з 1С:Підприємство </li>
	<li> ваше ім`я користувача (нік-нейм) на цьому сайті, наприклад, NeoSeo </li>
	<li> номер замовлення на цьому сайті, наприклад, 355446 </li>
	<li> основний домен сайту для якого буде активований файл з ключем, наприклад, https://neoseo.ua </li>
</ul>

<p> Отриманий файл з ключем покладіть у корінь сайту, тобто поруч з файлом robots.txt і натисніть кнопку "Перевірити ще раз".</p>';
$_['error_ioncube_missing']='<h3 style="color: red">Відсутній IonCube Loader!</h3>

<p>Щоб користуватися нашим модулем, вам потрібно встановити IonCube Loader.</p>

<p>Для установки зверніться до ТП Вашого хостингу</p>

<p>Якщо ви не можете встановити IonCube Loader самостійно, у вас є можливість попросити допомоги у наших фахівців за адресою <a href="mailto:info@neoseo.com.ua"> info@neoseo.com.ua </a></p>';
$_['module_licence']='<h2>Ліцензійні умови згоди на використання програмного забезпечення NeoSeo</h2>
<p>Дякуємо вам за покупку програмних продуктів нашої веб-студії.</p>
<p>Нижче наведені юридичні умови, які поширюються на всіх, хто відвідує наш сайт і користується нашими програмними продуктами або послугами. Дані умови спрямовані на те, щоб захистити ваші інтереси та інтереси ТОВ "НЕОСЕО" і його афілійованих структур і осіб (далі, "ми", "NeoSeo"), які виступають в договорах від його імені.</p>
<p><strong>1. Введення</strong></p>
<p>Ці Умови використання NeoSeo ( "Умови використання") поряд з додатковими умовами, які стосуються ряду конкретних послуг або програмних продуктів, розробок і представлені на веб-сайті (-ів) NeoSeo, містять умови і положення, дія яких поширюється на кожного відвідувача або користувача ( "Користувач", "ви" або "Покупець") веб-сайту NeoSeo, додатків, доповнень і компонентів, запропонованих нами поряд з наданням послуг і веб-сайту, якщо не вказано інше (всі послуги та програмне забезпечення, програмні модулі запропоновані через веб-сайт NeoSeo або допоміжні сервіси, веб-сервіси, ін. додатки від імені NeoSeo спільно іменуються - "Послуги NeoSeo" або "Послуги").</p>
<p>Умови NeoSeo є обов`язковим контрактом між NeoSeo і вами - тому просимо вас уважно ознайомитися з ними.</p>
<p>Ви можете відвідувати і / або використовувати Послуги NeoSeo тільки в тому випадку, якщо повністю згодні з Умовами NeoSeo: використовуючи будь-яку з Послуг NeoSeo і / або підписуючись на неї, ви висловлюєте і підтверджуєте свою згоду з даними Умовами користування та іншими Умовами NeoSeo, наприклад, умови надання послуг програмування в розрізі типових і нетипових завдань, які виписані тут:   <a href="https://neoseo.com.ua/vse-chto-nujno-znat-klienty" target="_blank" class="external">https://neoseo.com.ua/vse-chto-nujno-znat-klienty</a> , (далі Умови NeoSeo).</p>
<p>Якщо ви не можете прочитати Умови NeoSeo, не знаєте їх або не згодні з ними, ви повинні покинути Веб-сайт NeoSeo і не користуватися Послугами NeoSeo.</p>
<p>Використовуючи наші Програмні продукти, Сервіси і Послуги, ви підтверджуєте, що ознайомилися з нашою Політикою конфіденційності, доступною до перегляду за адресою <a href="https://neoseo.com.ua/politika-konfidencialnosti" target="_blank" class="external">https://neoseo.com.ua/politika-konfidencialnosti</a>   ("Політика конфіденційності").</p>
<p>Цей документ є ліцензійною угодою між вами і NeoSeo.</p>
<p>Погоджуючись на цю угоду або використовуючи програмне забезпечення, ви погоджуєтеся з усіма цими умовами.</p>
<p>Ця угода відноситься до програмного забезпечення NeoSeo, будь-яких шрифтів, піктограм, зображень або звукових файлів, що надаються у складі програмного забезпечення, а також до всіх оновлень, доповнень або служб NeoSeo для програмного забезпечення, якщо в їх відношенні не застосовуються інші умови. Це також стосується розроблених в NeoSeo додатків і доповнень для SEO-Магазину, які забезпечують розширення його функціональних можливостей.</p>
<p>До використання вами деяких функцій додатків можуть застосовуватися додаткові умови NeoSeo і третіх осіб. Для коректної роботи деяких додатків необхідні додаткові угоди з окремими умовами та політиками конфіденційності, наприклад з сервісами, які надають послуги смс-нотифікації.</p>
<p>Програмне забезпечення не продається, а надається за ліцензією.</p>
<p>NeoSeo зберігає за собою всі права (наприклад, права, передбачені законами про захист інтелектуальної власності), які не надаються явно в рамках цієї угоди. Наприклад, ця ліцензія не надає вам права:</p>
<li><span></span><span></span>окремо використовувати або віртуалізувати компоненти програмного забезпечення;</li>
<li>публікувати або копіювати (за винятком дозволеної резервної копії) програмне забезпечення, надавати програмне забезпечення у прокат, в оренду або в тимчасове користування;</li>
<li>передавати програмне забезпечення (за винятком випадків, передбачених цією угодою);</li>
<li>намагатися обійти технічні обмеження програмного продукту;</li>
<li>вивчати технологію, декомпілювати або деасемблувати програмне забезпечення, а також вживати відповідні спроби, крім тих що в мірі та у випадках, коли це (а) передбачено відповідним правом; (б) дозволено умовами ліцензії на використання компонентів з відкритим вихідним кодом, які можуть входити до складу цього програмного забезпечення; (c) необхідно для налагодження змін будь-яких бібліотек, що ліцензуються по малій стандартній громадській ліцензії GNU, які входять до складу програмного забезпечення та пов`язані з ним;</li>
<p>Ви маєте право використовувати дане програмне забезпечення, тільки якщо у вас є відповідна ліцензія і програмне забезпечення було належним чином активовано з використанням справжнього ключа продукту або в інший дозволений спосіб.</p>
<p>У вартість ліцензії SEO-Магазину не включені послуги установки, настройки і тим більше його стилізації, також як і інші платні / безкоштовні доповнення до нього. Дані послуги є додатковими, вартість залежить від кількості необхідних для реалізації годин, детальніше тут: <a href="https://neoseo.com.ua/vse-chto-nujno-znat-klienty" target="_blank" class="external">https://neoseo.com.ua/vse-chto-nujno-znat-klienty</a></p>
<p>З повною версією документа можна ознайомитися тут:</p>
<p><a href="https://neoseo.com.ua/usloviya-licenzionnogo-soglasheniya" target="_blank" class="external">https://neoseo.com.ua/usloviya-licenzionnogo-soglasheniya</a>
</p>';
$_['mail_support']='<P> Завжди раді допомогти, </ p>
<P> Відділ підтримки Клієнтів, веб-студія NeoSeo. </ P>
<P> Нагадуємо, веб-студія NeoSeo пропонує інформаційну підтримку безкоштовно на форумі <a href="https://opencartmasters.com/"> OpenCartMasters.com </a>
    (Зазвичай відповіді надаються протягом доби протягом робочого дня). </ P>
<P>
    Якщо у Вас термінове питання і його треба вирішити вже, будь ласка, замовляйте платну підтримку, яка надається в той же день з використанням Skype і TeamViewer.
</ P>
<P>
    Із загальних питань пишіть в телеграм чат <a href="https://t.me/WebStudioNeoSeo1"> https://t.me/WebStudioNeoSeo1 </a>
</ P>
<P>
    Гарного дня і відмінного настрою :) <br>
    Команда NeoSeo. </ P>';
